Dlubal.RFEM5.ArcLengthDimension
Arc length dimension parameters

Dlubal.RFEM5.ArcLengthDimension.No
Number

Dlubal.RFEM5.ArcLengthDimension.ID
Identifier

Dlubal.RFEM5.ArcLengthDimension.Tag
Tag

Dlubal.RFEM5.ArcLengthDimension.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.ArcLengthDimension.LineNo
Arc or circle number

Dlubal.RFEM5.ArcLengthDimension.NodeList
List of nodes

Dlubal.RFEM5.ArcLengthDimension.Placement
Placement of arc length dimension

Dlubal.RFEM5.ArcLengthDimension.Offset
Offset

Dlubal.RFEM5.ArcLengthDimension.Lengths
Array of arc lengths (read only)

Dlubal.RFEM5.ArcLengthDimension.Symbol
Symbol